atif-ali400/CandCPlusLearning/Projects/STM32F767ZI-Nucleo/Applications/LwIP/LwIP_HTTP_Server_Netconn_RTOS/Src/httpserver-netconn.c
          if((!LoggedIn)&&(login_attempt == 0)){
          fs_open(&file, "/401.html");
          netconn_write(conn, (const unsigned char*)un_auth_code, (size_t)strlen(un_auth_code), NETCONN_NOCOPY);
          netconn_write(conn, (const unsigned char*)auth_header, (size_t)strlen(auth_header), NETCONN_NOCOPY);
          netconn_write(conn, (const unsigned char*)(file.data), (size_t)file.len, NETCONN_NOCOPY);
          login_attempt++;
          fs_close(&file);
          }
          else if((!LoggedIn)&&(login_attempt == 1)){
          
          //fs_open(&file, "/401.html");
         // netconn_write(conn, (const unsigned char*)un_auth_code, (size_t)strlen(un_auth_code), NETCONN_NOCOPY);
         // netconn_write(conn, (const unsigned char*)auth_header, (size_t)strlen(auth_header), NETCONN_NOCOPY);
         // netconn_write(conn, (const unsigned char*)(file.data), (size_t)file.len, NETCONN_NOCOPY);
         // fs_close(&file);
   char* auth_str = strstr(buf, "Authorization: Basic");    
   char *rest;
   char *token;
   char *user_pass;
   //char* decoded_user_pass;
   size_t size;
   //Retrieve the authentication scheme and password
   token = strtok_r(auth_str, " \t", &rest);
   token = strtok_r(NULL, " \t", &rest);
   user_pass = strtok_r(NULL, " \n", &rest);
  // b64_decode(user_pass, decoded_user_pass, size);
 //  decoded_user_pass  = base64_decode(user_pass,strlen(user_pass), &size);
    //Properly terminate the string
      //      decoded_user_pass[size] = '\0';
#if 0
    //To do: check if decoding is Successful 
            //Properly terminate the string
            user_pass[size] = '\0';
            //Check whether a separator is present
           char* separator = strchr(user_pass, ':');

            //Separator found?
            if(separator != NULL)
            {
               //Split the line
               *separator = '\0';

               //Point to the password
               user_pass = separator + 1;
               //Save password
               
               
            }   
#endif       
           // netconn_write(conn, (const unsigned char*)success_code, (size_t)strlen(success_code), NETCONN_NOCOPY);
            netconn_write(conn, (const unsigned char*)user_pass, (size_t)strlen(user_pass), NETCONN_NOCOPY);
            
           // base64_cleanup();
          }
          /* Load STM32F7xx page */
          else{
          fs_open(&file, "/STM32F7xx.html"); 
          netconn_write(conn, (const unsigned char*)(file.data), (size_t)file.len, NETCONN_NOCOPY);
          fs_close(&file);
          }
        }
        //Start of the test string for embedded webserver
        else if((strncmp(buf, "GET /style.css", 14) == 0)||(strncmp(buf, "GET / ", 6) == 0)) 
        {
          /* Load css styles page */
          fs_open(&file, "/style.css"); 
          netconn_write(conn, (const unsigned char*)(file.data), (size_t)file.len, NETCONN_NOCOPY);
          fs_close(&file);
        }
        else if((strncmp(buf, "GET /functions.js", 17) == 0)||(strncmp(buf, "GET / ", 6) == 0)) 
        {
          /* Load functions js page */
          fs_open(&file, "/functions.js"); 
          
          netconn_write(conn, (const unsigned char*)(file.data), (size_t)file.len, NETCONN_NOCOPY);
          fs_close(&file);
        }
        
        
        else 
        {
          /* Load Error page */
          fs_open(&file, "/404.html"); 
          netconn_write(conn, (const unsigned char*)(file.data), (size_t)file.len, NETCONN_NOCOPY);
          fs_close(&file);
        }
      }
      //This is for the POST request
      /* Is this an HTTP POST command? (only check the first 6 chars, since
      there are other formats for POST, and we're keeping it very simple )*/
      else if ((buflen >=6) && (strncmp(buf, "POST /", 6) == 0))
      {
       // char *SuccessfulPOSTResponse = "Nothing";
        //netconn_write(conn, (const unsigned char*)buf, (size_t)strlen(buf), NETCONN_NOCOPY);
        char* payload = strchr((const char*)buf,'{');
        json_t const* json = json_create(payload,tokens,(sizeof(tokens)/sizeof (*tokens)));
      //  netconn_write(conn, (const unsigned char*)payload, (size_t)strlen(payload), NETCONN_NOCOPY);
        if(json)
        {
          volatile int test = 2;
        }
       // json_t const* led1On= json_getProperty(json,"led1On");
        //json_t const* led2On= json_getProperty(json,"led2On");
       // json_t const* led3On= json_getProperty(json,"led3On");
        
        char const* led1Value = json_getPropertyValue(json,"led1On");
        char const* led2Value = json_getPropertyValue(json,"led2On");
        char const* led3Value = json_getPropertyValue(json,"led3On");
        /* Check if request to POST  */ 
        
        if((strncmp(buf, "POST /STM32F7xx.html", 20) == 0)||(strncmp(buf, "POST / ", 7) == 0))
        {
         // char* payload = strchr(( char*)buf,'{');
          
                    //if((strncmp(payload, "ledOn\":true", 11) == 0))
         // if((strstr(payload, "led1On=true"))!=NULL)
          if(strcmp(led1Value, "true") == 0)
        {
          /* Turn On LED 1 on client request*/
           BSP_LED_On(LED1);
           ledStatus_s.led1 = true;
          
        }else{
        
          BSP_LED_Off(LED1);
          ledStatus_s.led1 = false;
        }
       // if((strstr(payload, "led2On=true"))!=NULL)
        if(strcmp(led2Value, "true") == 0)
        {
          /* Turn On LED 2 on client request*/
           BSP_LED_On(LED2);
           ledStatus_s.led2 = true;
          
        }else
        {
          BSP_LED_Off(LED2);
          ledStatus_s.led2 = false;
        }
        //if((strstr(payload, "led3On=true"))!=NULL)
        if(strcmp(led3Value, "true") == 0)
        {
          /* Turn On LED 2 on client request*/
           BSP_LED_On(LED3);
           ledStatus_s.led3 = true;
          
          
        }else
        {
          BSP_LED_Off(LED3);
          ledStatus_s.led3 = false;
        }
        // netconn_write(conn, (const unsigned char*)payload, (size_t)strlen(payload), NETCONN_NOCOPY);
           int json_data_length = led_status_to_json(json_output, &ledStatus_s);
    //  if(json_data_length<= buflen)
           netconn_write(conn, (const unsigned char*)json_output, (size_t)strlen(json_output), NETCONN_NOCOPY);
      }
      
      
          
        //  netconn_write(conn, (const unsigned char*), (size_t)strlen(payload), NETCONN_NOCOPY);
//          if((strncmp(buf, "POST /STM32F7xx.html", 31) == 0))
//        {
//          /* Turn On LED 2 on client request*/
//           BSP_LED_On(LED2);
//           SuccessfulPOSTResponse = "LEDOn";
//           netconn_write(conn, (const unsigned char*)SuccessfulPOSTResponse, (size_t)strlen(SuccessfulPOSTResponse), NETCONN_NOCOPY);
//          
//        }else
//        {
//          BSP_LED_Off(LED2);
//          SuccessfulPOSTResponse = "LEDNotfound";
//          netconn_write(conn, (const unsigned char*)SuccessfulPOSTResponse, (size_t)strlen(SuccessfulPOSTResponse), NETCONN_NOCOPY);
//        }
//          char *data = "{ 'StatusCode': 200, 'Message': 'Success'}";
//          int resultCode;
//          jsmn_parser parser;
//          jsmntok_t token[128]; /* We expect no more than 128 JSON tokens */
//          
//          jsmn_init(&parser);
//          resultCode = jsmn_parse(&parser, data, strlen(data), token, 128);
          
          //char *buffer;
          //Json maker test code starts
        /*
          static struct data const data = {
        .city    = "liverpool",
        .street  = "mathew",
        .measure = {
            .weather = {
                .hum  = 65,
                .temp = 25
            },
            .time = {
                .hour   = 14,
                .minute = 31
            }
        },
        .samples = {
             25,
             65,
            -37,
            512
        }
    };
    char buff[512];
    int len = data_to_json( buff, &data );
          
          //Json maker test code ends
          
